In [1]:
import pandas as pd
import numpy as np

In [21]:
#a = pd.read_csv('C:\\Users\\DELL\\Desktop\\data.csv')
a= pd.read_csv('C:\\Users\\DELL\\Desktop\\data.csv', delimiter=' ', header=None, names=['Stock Name', 'No_of_Shares', 'Price'])

In [22]:
df =pd.DataFrame(a)
df

  Stock Name  No_of_Shares  Price
0         AA           100  32.20
1        IBM            50  91.10
2        CAT           150  83.44
3       MSFT           200  51.23
4         GE            95  40.37
5       MSFT            50  65.10
6        IBM           100  70.44

In [24]:
df['Total']=df['No_of_Shares']*df['Price']
df

  Stock Name  No_of_Shares  Price     Total
0         AA           100  32.20   3220.00
1        IBM            50  91.10   4555.00
2        CAT           150  83.44  12516.00
3       MSFT           200  51.23  10246.00
4         GE            95  40.37   3835.15
5       MSFT            50  65.10   3255.00
6        IBM           100  70.44   7044.00

In [25]:
df['Total'].sum()

44671.15

# Using Python

In [15]:
# pcost.py

total_cost = 0.0

with open('C:\\Users\\DELL\\Desktop\\data.csv', 'r') as f:
    for line in f:
        fields = line.split()
        nshares = int(fields[1])
        price = float(fields[2])
        total_cost = total_cost + nshares * price

print(total_cost)

44671.15